app/controllers/messages_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."phone_number" = ? LIMIT 1  [["phone_number", "+16262287464"]]
SELECT  1 AS one FROM "users" WHERE "users"."phone_number" = ? LIMIT 1  [["phone_number", "+16262287464"]]
---
  def reply
    from_number = params["From"]

    if User.exists?(phone_number: from_number.to_s)